#include <stdio.h>
int main(void) {
int a=0;
printf("-128부터 127까지의 십진수 정수 하나를 입력하세요:");
scanf("%d",&a);

int k=a;
if (k<0)
k= k*(-1);

int b1, b2, b3, b4, b5, b6, b7, b8 = 0;

b8 = k%2;
k = k/2;
b7 = k%2;
k = k/2;
b6 = k%2;
k = k/2;
b5 = k%2;
k = k/2;

b4= k%2;
k = k/2;
b3 =k%2;
k = k/2;
b2= k%2;
k = k/2;

if (a>=0)
b1=0;

if (a<0)
{ 
(b8==0) ? (b8=1) : (b8=0);

(b7==0) ? (b7=1) : (b7=0);

(b6==0) ? (b6=1) : (b6=0);

(b5==0) ? (b5=1) : (b5=0);

(b4==0) ? (b4=1) : (b4=0);

(b3==0) ? (b3=1) : (b3=0);

(b2==0) ? (b2=1) : (b2=0);
b1 =1;

b8+=1;

{if (b8==2)
{b8 =0;
b7+=1;}}

{if (b7==2)
{b7 = 0;
b6+=1;}}

{if (b6==2)
{b6 =0;
b5+=1;}}

{if (b5==2)
{b5=0;
b4+=1;}}

{if (b4==2)
{b4=0;
b3+=1;}}

{if (b3==2)
{b3=0;
b2+=1;}}

{if (b2==2)
b2=0;}
}

printf("%d의 이진수는 %d%d%d%d %d%d%d%d 입니다.\n", a,b1,b2,b3,b4,b5,b6,b7,b8);
return 0;
}
